## Microsoft Movie Pitch Submission

* Student name: Ashleigh Stephens
* Student pace: FLEX 60 Wk
* Scheduled project review date/time: 
* Instructor name: Abhineet
* Blog post URL: N/A

In this project description, we will cover:

* [***Project Overview:***](#project-overview) the project goal, audience, and dataset
* [***Deliverables:***](#deliverables) the specific items you are required to produce for this project
* [***Grading:***](#grading) how your project will be scored
* [***Getting Started:***](#getting-started) guidance for how to begin your first project

## Project Overview

Using exploratory data analysis to generate insights for a business stakeholder.

### Business Problem

Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they don’t know anything about creating movies. You are charged with exploring what types of films are currently doing the best at the box office. You must then translate those findings into actionable insights that the head of Microsoft's new movie studio can use to help decide what type of films to create.

### The Data

In the folder `zippedData` are movie datasets from:

* [Box Office Mojo](https://www.boxofficemojo.com/)
* [IMDB](https://www.imdb.com/)
* [Rotten Tomatoes](https://www.rottentomatoes.com/)
* [TheMovieDB](https://www.themoviedb.org/)
* [The Numbers](https://www.the-numbers.com/)

It is up to you to decide what data from this to use and how to use it. If you want to make this more challenging, you can scrape websites or make API calls to get additional data. If you are feeling overwhelmed or behind (e.g. struggled with the Phase 1 Code Challenge), we recommend you use only the following data files:

* imdb.title.basics
* imdb.title.ratings
* bom.movie_gross

In [169]:
# I'll want to groupby for genre

In [170]:
# Open files
import pandas as pd  # Alias pandas to be referred to as pd
import numpy as np  # Alias numpy to be referred to as np
import matplotlib.pyplot as plt  # Alias matplotlib.pyplot to be referred to as plt
import seaborn as sns  # Alias seaborn to be referred to as sns
from glob import glob
import os

# Allows plot outputs
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

In [171]:
# bom.movie_gross.csv.gz
MGdf
# imdb.name.basics.csv.gz
NBdf 
# imdb.title.akas.csv.gz
TAdf 
# imdb.title.basics.csv.gz
TBdf 
# imdb.title.crew.csv.gz
TCdf 
# imdb.title.principals.csv.gz
TPdf 
# imdb.title.ratings.csv.gz
TRdf 
# rt.movie_info.tsv.gz
MIdf 
# tmdb.movies.csv.gz
Mdf 
# tn.movie_budgets.csv.gz
MBdf

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [172]:
#pandas support zip file reads
# bom.movie_gross.csv.gz
MGrawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/bom.movie_gross.csv.gz")
# imdb.name.basics.csv.gz
NBrawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/imdb.name.basics.csv.gz")
# imdb.title.akas.csv.gz
TArawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/imdb.title.akas.csv.gz")
# imdb.title.basics.csv.gz
TBrawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/imdb.title.basics.csv.gz")
# imdb.title.crew.csv.gz
TCrawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/imdb.title.crew.csv.gz")
# imdb.title.principals.csv.gz
TPrawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/imdb.title.principals.csv.gz")
# imdb.title.ratings.csv.gz
TRrawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/imdb.title.ratings.csv.gz")
# rt.movie_info.tsv.gz
MIrawdf = pd.read_table("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/rt.movie_info.tsv.gz")
# SKIP rt.reviews.tsv.gz 
# Probably need tsv to csv or read_table
# Rdf = pd.read_csv"(/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/rt.reviews.tsv.gz")
# tmdb.movies.csv.gz
Mrawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/tmdb.movies.csv.gz")
# tn.movie_budgets.csv.gz
MBrawdf = pd.read_csv("/Users/as/Documents/Flatiron/Project_1/dsc-phase-1-project-v2-3/zippedData/tn.movie_budgets.csv.gz")

In [173]:
# To see the size before I begin to merge data
# to make sure data isn't lost
print(f'Movie Gross:', MGrawdf.shape)
print(f'Name Basics:', NBrawdf.shape)
print(f'Title AKAs:', TArawdf.shape)
print(f'Title Basics:', TBrawdf.shape)
print(f'Title Crew:', TCrawdf.shape)
print(f'Title Principals:', TPrawdf.shape)
print(f'Title Ratings:', TRrawdf.shape)
print(f'Movie Info:',MIrawdf.shape)
print(f'Movies:', Mrawdf.shape)
print(f'Movie Budgets:', MBrawdf.shape)

Movie Gross: (3387, 5)
Name Basics: (606648, 6)
Title AKAs: (331703, 8)
Title Basics: (146144, 6)
Title Crew: (146144, 3)
Title Principals: (1028186, 6)
Title Ratings: (73856, 3)
Movie Info: (1560, 12)
Movies: (26517, 10)
Movie Budgets: (5782, 6)

In [174]:
# To see the size before I begin to merge data
# 'df.shape' is used. To see what columns exist
# and null data within 'df.isnull().sum()' is used.
# By dividing the missing data sum by size will
# give you the percentage of missing data. Significant
# missing data will be replaced or culled. 
print(f'Movie Gross:', 
      MGrawdf.shape,
      MGrawdf.isnull().sum())
print(f'Name Basics:', 
      NBrawdf.shape,
      NBrawdf.isnull().sum())
print(f'Title AKAs:', 
      TArawdf.shape,
      TArawdf.isnull().sum())
print(f'Title Basics:', 
      TBrawdf.shape,
      TBrawdf.isnull().sum())
print(f'Title Crew:', 
      TCrawdf.shape,
      TCrawdf.isnull().sum())
print(f'Title Principals:', 
      TPrawdf.shape,
      TPrawdf.isnull().sum())
print(f'Title Ratings:', 
      TRrawdf.shape,
      TRrawdf.isnull().sum())
print(f'Movie Info:', 
      MIrawdf.shape,
      MIrawdf.isnull().sum())
print(f'Movies:', 
      Mrawdf.shape,
      Mrawdf.isnull().sum())
print(f'Movie Budgets:', 
      MBrawdf.shape,
      MBrawdf.isnull().sum())

Movie Gross: (3387, 5) title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64
Name Basics: (606648, 6) nconst                     0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
known_for_titles       30204
dtype: int64
Title AKAs: (331703, 8) title_id                  0
ordering                  0
title                     0
region                53293
language             289988
types                163256
attributes           316778
is_original_title        25
dtype: int64
Title Basics: (146144, 6) tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64
Title Crew: (146144, 3) tconst           0
directors     5727
writers      35883
dtype: int64
Title Principals: (1028186, 6) tconst             0
ordering           0
nconst             0
category           0
job           850502
characters    634826
dtype: int64
Title Ratings: (73856, 3) tconst           0
averagerating    0
numvotes         0
dtype: int64
Movie Info: (1560, 12) id                 0
synopsis          62
rating             3
genre              8
director         199
writer           449
theater_date     359
dvd_date         359
currency        1220
box_office      1220
runtime           30
studio          1066
dtype: int64
Movies: (26517, 10) Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64
Movie Budgets: (5782, 6) id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

Now to look at the columns present in each table in anticipation of merges; replace or delete null values and delete unnecessary columns.

In [175]:
# MGdf = bom.movie_gross.csv.gz
# Look at Movie Gross first
print(f'Movie Gross:', 
      MGrawdf.shape,
      MGrawdf.isnull().sum())

Movie Gross: (3387, 5) title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [176]:
# Find the percentage of missing values:
# Sum of null values divided by total instances
# multiply by 100 to get %
NullStudio = (MGrawdf['studio'].isnull().sum()
               / len(MGrawdf)) * 100

# Make a readable statement to express the percentage of missing values.
print(round(NullStudio, 2))

0.15

In [177]:
# Find percentage for remaining nulls
NullDG = (MGrawdf['domestic_gross'].isnull().sum()
               / len(MGrawdf)) * 100
print(round(NullDG, 2))

NullFG = (MGrawdf['foreign_gross'].isnull().sum()
               / len(MGrawdf)) * 100
print(round(NullFG, 2))

0.83
39.86

In [178]:
# Formula to shorten time for other columns
def NullPer(column, df):
    PercentNull = (df[column].isnull().sum()
                   / len(df)) * 100
    return print(f'Null Percentage',(column),(round(PercentNull, 2)))

In [179]:
# Run test to see if values match from above
NullPer('domestic_gross', MGrawdf)
NullPer('foreign_gross', MGrawdf)

Null Percentage domestic_gross 0.83
Null Percentage foreign_gross 39.86

Within Movie Gross, columns stuido and domestic_gross are under 1%, so removing the missing values are the best to clean the data. Unfortunately, foreign_gross has nearly 40% of missing values. I should remove the entire column and hope to pull the data in from another table or website.

In [180]:
MGdf = MGrawdf.dropna(subset=['studio', 'domestic_gross'])
# foreign_gross NaN to $0
NullPer('studio', MGdf)
NullPer('domestic_gross', MGdf)
NullPer('foreign_gross', MGdf)

Null Percentage studio 0.0
Null Percentage domestic_gross 0.0
Null Percentage foreign_gross 40.2

In [181]:
print(f'Movie Gross:', 
      MGdf.shape,
      MGdf.isnull().sum())

Movie Gross: (3356, 5) title                0
studio               0
domestic_gross       0
foreign_gross     1349
year                 0
dtype: int64

Due to missing data being removed from stuido and domestic_gross, altering the overall data shape, the percentage for foreign_gross changed slightly. 

Now to remove the foreign_gross column.

In [182]:
MGdf = MGdf.drop('foreign_gross', 1)

In [183]:
print(f'Movie Gross:', 
      MGdf.shape,
      MGdf.isnull().sum())

Movie Gross: (3356, 4) title             0
studio            0
domestic_gross    0
year              0
dtype: int64

In [184]:
# imdb.name.basics.csv.gz
NBdf
# What is known_for_titles?

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [24]:
# Delete birth_year, death_year
NBdf = NBrawdf.drop(columns=['birth_year', 'death_year'])
NBdf.head()

,nconst,primary_name,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [ ]:
# nconst will connect to TPdf
# need to break up primary_profession and known_for_titles to pair with each primary_name

In [6]:
# imdb.title.akas.csv.gz
TAdf
# I don't think I need this
# Delete region, language, types, attributes, is_original_title

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,NaN,NaN,original,NaN,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,NaN,0.0
331700,tt9880178,1,La atención,NaN,NaN,original,NaN,1.0
331701,tt9880178,2,La atención,ES,NaN,NaN,NaN,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,NaN,0.0

In [7]:
# imdb.title.basics.csv.gz
TBdf

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [8]:
# imdb.title.crew.csv.gz
TCdf

           tconst                      directors              writers
0       tt0285252                      nm0899854            nm0899854
1       tt0438973                            NaN  nm0175726,nm1802864
2       tt0462036                      nm1940585            nm1940585
3       tt0835418                      nm0151540  nm0310087,nm0841532
4       tt0878654  nm0089502,nm2291498,nm2292011            nm0284943
...           ...                            ...                  ...
146139  tt8999974                     nm10122357           nm10122357
146140  tt9001390                      nm6711477            nm6711477
146141  tt9001494          nm10123242,nm10123248                  NaN
146142  tt9004986                      nm4993825            nm4993825
146143  tt9010172                            NaN            nm8352242

[146144 rows x 3 columns]

In [9]:
# imdb.title.principals.csv.gz
TPdf

,tconst,ordering,nconst,category,job,characters
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,2,nm0398271,director,NaN,NaN
2,tt0111414,3,nm3739909,producer,producer,NaN
3,tt0323808,10,nm0059247,editor,NaN,NaN
4,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,NaN,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,NaN,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,NaN,NaN
1028184,tt9692684,4,nm6009913,writer,writer,NaN
1028185,tt9692684,5,nm10441595,producer,producer,NaN

In [10]:
# imdb.title.ratings.csv.gz
TRdf

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [15]:
# rt.movie_info.tsv.gz
MIdf.keys()

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [16]:
# tmdb.movies.csv.gz
Mdf
# rm Unnamed, original_language, original_title (most likely), vote_average, vote_count

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [17]:
# tn.movie_budgets.csv.gz
MBdf
# change movie to title, Delete id (maybe)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [18]:
# To find similar columns
print(f'Movie Gross:', MGdf.keys())
print(f'Name Basics:', NBdf.keys())
print(f'Title AKAs:', TAdf.keys())
print(f'Title Basics:', TBdf.keys())
print(f'Title Crew:', TCdf.keys())
print(f'Title Principals:', TPdf.keys())
print(f'Title Ratings:', TRdf.keys())
print(f'Movie Info:',MIdf.keys())
print(f'Movies:',Mdf.keys())
print(f'Movie Budgets:',MBdf.keys())

Movie Gross: Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')
Name Basics: Index(['nconst', 'primary_name', 'birth_year', 'death_year',
       'primary_profession', 'known_for_titles'],
      dtype='object')
Title AKAs: Index(['title_id', 'ordering', 'title', 'region', 'language', 'types',
       'attributes', 'is_original_title'],
      dtype='object')
Title Basics: Index(['tconst', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')
Title Crew: Index(['tconst', 'directors', 'writers'], dtype='object')
Title Principals: Index(['tconst', 'ordering', 'nconst', 'category', 'job', 'characters'], dtype='object')
Title Ratings: Index(['tconst', 'averagerating', 'numvotes'], dtype='object')
Movie Info: Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')
Movies: Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')
Movie Budgets: Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

Movie Gross + Movies by title
Movie + Movie Budget by id 
Movie Info (remove column 0) + by title

In [101]:
TC_TPdf = TCdf.merge(TPdf, how='right', on='tconst')
TC_TPdf

,tconst,directors,writers,ordering,nconst,category,job,characters
0,tt0111414,nm0398271,nm0398271,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,nm0398271,nm0398271,2,nm0398271,director,NaN,NaN
2,tt0111414,nm0398271,nm0398271,3,nm3739909,producer,producer,NaN
3,tt0323808,nm0362736,nm0362736,10,nm0059247,editor,NaN,NaN
4,tt0323808,nm0362736,nm0362736,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
...,...,...,...,...,...,...,...,...
1028181,tt9692684,nm10441594,nm6009913,1,nm0186469,actor,NaN,"[""Ebenezer Scrooge""]"
1028182,tt9692684,nm10441594,nm6009913,2,nm4929530,self,NaN,"[""Herself"",""Regan""]"
1028183,tt9692684,nm10441594,nm6009913,3,nm10441594,director,NaN,NaN
1028184,tt9692684,nm10441594,nm6009913,4,nm6009913,writer,writer,NaN
1028185,tt9692684,nm10441594,nm6009913,5,nm10441595,producer,producer,NaN

In [104]:
TC_TBdf = TC_TPdf.merge(TBdf, how='right', on='tconst')
TC_TBdf

,tconst,directors,writers,ordering,nconst,category,job,characters,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,nm0712540,"nm0023551,nm1194313,nm0347899,nm1391276",10.0,nm0006210,composer,NaN,NaN,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0063540,nm0712540,"nm0023551,nm1194313,nm0347899,nm1391276",1.0,nm0474801,actor,NaN,"[""Kundan S. Prasad"",""Bajrangi""]",Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
2,tt0063540,nm0712540,"nm0023551,nm1194313,nm0347899,nm1391276",2.0,nm0904537,actress,NaN,"[""Munni"",""Laila-E-Aasmaan""]",Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
3,tt0063540,nm0712540,"nm0023551,nm1194313,nm0347899,nm1391276",3.0,nm0756379,actor,NaN,"[""Ganeshi N. Prasad""]",Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
4,tt0063540,nm0712540,"nm0023551,nm1194313,nm0347899,nm1391276",4.0,nm0474876,actor,NaN,"[""Dwarka N. Prasad""]",Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1030871,tt9916754,"nm9272490,nm8349149","nm8349149,nm9272490",5.0,nm9272490,director,supervising director,NaN,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary
1030872,tt9916754,"nm9272490,nm8349149","nm8349149,nm9272490",6.0,nm8349149,director,co-director,NaN,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary
1030873,tt9916754,"nm9272490,nm8349149","nm8349149,nm9272490",7.0,nm9272489,cinematographer,NaN,NaN,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary
1030874,tt9916754,"nm9272490,nm8349149","nm8349149,nm9272490",8.0,nm10538638,cinematographer,NaN,NaN,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary
1030875,tt9916754,"nm9272490,nm8349149","nm8349149,nm9272490",9.0,nm10538635,cinematographer,NaN,NaN,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [105]:
# To find similar columns
print(f'Movie Gross:', MGdf.keys())
print(f'Title AKAs:', TAdf.keys())
print(f'Merged Title Basics:', TC_TBdf.keys())
print(f'Movie Info:',MIdf.keys())
print(f'Movies:',Mdf.keys())
print(f'Movie Budgets:',MBdf.keys())

Movie Gross: Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')
Title AKAs: Index(['title_id', 'ordering', 'title', 'region', 'language', 'types',
       'attributes', 'is_original_title'],
      dtype='object')
Merged Title Basics: Index(['tconst', 'directors', 'writers', 'ordering', 'nconst', 'category',
       'job', 'characters', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')
Movie Info: Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')
Movies: Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')
Movie Budgets: Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

In [70]:
TB_ = TP_TBdf.merge(MBdf, how='left', on='tconst')
TCdf

           tconst                      directors              writers
0       tt0285252                      nm0899854            nm0899854
1       tt0438973                            NaN  nm0175726,nm1802864
2       tt0462036                      nm1940585            nm1940585
3       tt0835418                      nm0151540  nm0310087,nm0841532
4       tt0878654  nm0089502,nm2291498,nm2292011            nm0284943
...           ...                            ...                  ...
146139  tt8999974                     nm10122357           nm10122357
146140  tt9001390                      nm6711477            nm6711477
146141  tt9001494          nm10123242,nm10123248                  NaN
146142  tt9004986                      nm4993825            nm4993825
146143  tt9010172                            NaN            nm8352242

[146144 rows x 3 columns]

In [ ]:


#Run individually
print(f'Movie Gross:', MGdf.head())
print(f'Name Basics:', NBdf.head())
print(f'Title AKAs:', TAdf.head())
print(f'Title Basics:', TBdf.head())
print(f'Title Crew:', TCdf.head())
print(f'Title Principals:', TPdf.head())
print(f'Title Ratings:', TRdf.head())
print(MIdf.head())

print(f'Movies:',Mdf.head())
print(f'Movie Budgets:',MBdf.head())

In [46]:
# Pure curiousity
MGdf.describe()
# could potentially be used for comparing genres

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

### Key Points

* **Your analysis should yield three concrete business recommendations.** The ultimate purpose of exploratory analysis is not just to learn about the data, but to help an organization perform better. Explicitly relate your findings to business needs by recommending actions that you think the business (Microsoft) should take.

* **Communicating about your work well is extremely important.** Your ability to provide value to an organization - or to land a job there - is directly reliant on your ability to communicate with them about what you have done and why it is valuable. Create a storyline your audience (the head of Microsoft's new movie studio) can follow by walking them through the steps of your process, highlighting the most important points and skipping over the rest.

* **Use plenty of visualizations.** Visualizations are invaluable for exploring your data and making your findings accessible to a non-technical audience. Spotlight visuals in your presentation, but only ones that relate directly to your recommendations. Simple visuals are usually best (e.g. bar charts and line graphs), and don't forget to format them well (e.g. labels, titles).

## Deliverables

There are three deliverables for this project:

* A **non-technical presentation**
* A **Jupyter Notebook**
* A **GitHub repository**